C03/Nz50/Nz50_1000up/0.orig/alpha.concrete.orig
/*---------------------------*- C++ -*------------------------------*\
| ========= | |
| \\ / F ield | OpenFOAM: The Open Source CFD Toolbox |
| \\ / O peration | Version: 2.1.1 |
| \\ / A nd | Web: www.OpenFOAM.org |
| \\/ M anipulation | |
\*-----------------------------------------------------------------*/
FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 object alpha;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions [0 0 0 0 0 0 0];
internalField uniform 0;
boundaryField
{
 	inlet_water
 	{
 		type fixedValue;
		value uniform 1;
 	}
 	inlet_air
 	{
  		type fixedValue;
		value uniform 0;
 	}
 	outlet_water
 	{
 		type zeroGradient;
 	}
 	outlet_air
 	{
 		type zeroGradient;
 	}
 	lowerWall
 	{
		type zeroGradient;
        }
 	atmosphere
 	{
 		type inletOutlet;
		inletValue uniform 0;
		value uniform 0;
 	}
 	defaultFaces
 	{
	type empty;
 	}
}
// *************************************************************** //
